# TrussCrossingReferences Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TrussCrossingReferences Property
BuiltInFailures..::..SketchFailures Class See Also
---
Truss top and bottom references cannot cross.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussCrossingReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussCrossingReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussCrossingReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace